InformationRegisters/ОбщиеНастройкиРаспознаваниеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОбщиеНастройкиРаспознаваниеДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧастотаЗагрузкиДокументовИзСервиса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказыватьЭлементыНастройкиИнтерфейса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверятьЗамечанияПередСозданиемДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадаватьВопросОСохраненииСоответствийДляРаспознанныхСтрок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантСохраненияСоответствий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСохраненияСоответствийБРД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткрыватьНовыеЭлементыСправочниковПослеСоздания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаОбработчикаПоказыватьИзображенияВШапке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастотаОтправкиВложенийИзПочтыНаРаспознавание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаспознаватьВложенияИзПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочтаДляОбработкиВложений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейОбработкиВложений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаспознаватьФайлыИзКаталога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастотаОтправкиФайловИзКаталогаНаРаспознавание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогДляОбработкиФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключаяВложенныеКаталоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СкладБРД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорогНоменклатурыДляГрупповогоСоздания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТокенАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриОбнаруженииДокументаПрикреплятьИзображениеАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПомечатьДокументОбработаннымПриПрикреаленииИзображения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСчетФактуруПриСозданииОснования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыСохраненияСоответствийБРД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВариантыСохраненияСоответствийБРД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СохранятьАвтоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадаватьВопрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСохранятьИНеЗадаватьВопрос</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ОбщиеНастройкиРаспознаваниеДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекущиеНастройки() Экспорт
	
	ВариантСохраненияПоУмолчанию = Перечисления.ВариантыСохраненияСоответствийБРД.СохранятьАвтоматически;
	Результат = Новый Структура;
	Результат.Вставить("ЧастотаЗагрузкиДокументовИзСервиса", 30);
	Результат.Вставить("ПоказыватьЭлементыНастройкиИнтерфейса", Истина);
	Результат.Вставить("ПроверятьЗамечанияПередСозданиемДокументов", Истина);
	Результат.Вставить("ЗадаватьВопросОСохраненииСоответствийДляРаспознанныхСтрок", Ложь);
	Результат.Вставить("ВариантСохраненияСоответствий", ВариантСохраненияПоУмолчанию);
	Результат.Вставить("ОткрыватьНовыеЭлементыСправочниковПослеСоздания", Ложь);
	
	Результат.Вставить("ФормаОбработчикаПоказыватьИзображенияВШапке", Ложь);
	
	Результат.Вставить("РаспознаватьВложенияИзПочты", Ложь);
	Результат.Вставить("ЧастотаОтправкиВложенийИзПочтыНаРаспознавание", 30);
	Результат.Вставить("ЭлектроннаяПочтаДляОбработкиВложений", Неопределено);
	Результат.Вставить("ДатаПоследнейОбработкиВложений", '00010101');
	
	Результат.Вставить("РаспознаватьФайлыИзКаталога", Ложь);
	Результат.Вставить("ЧастотаОтправкиФайловИзКаталогаНаРаспознавание", 30);
	Результат.Вставить("КаталогДляОбработкиФайлов", 0);
	Результат.Вставить("ВключаяВложенныеКаталоги", 0);
	
	Результат.Вставить("СкладПоУмолчанию");
	Результат.Вставить("ПорогНоменклатурыДляГрупповогоСоздания", 0);
	Результат.Вставить("ПриОбнаруженииДокументаПрикреплятьИзображениеАвтоматически", Ложь);
	Результат.Вставить("ПомечатьДокументОбработаннымПриПрикреаленииИзображения", Истина);
	Результат.Вставить("СоздаватьСчетФактуруПриСозданииОснования", Ложь);
	Результат.Вставить("АдресЭлПочты", "");
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(Результат, МенеджерЗаписи);
		Если Результат.ВариантСохраненияСоответствий = Перечисления.ВариантыСохраненияСоответствийБРД.ПустаяСсылка() Тогда
			Результат.ВариантСохраненияСоответствий = ВариантСохраненияПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	
	// FIXME
	// Обнуление настроек, сохраненных в базе, для временного отключения подсистемы.
	
	Результат.Вставить("РаспознаватьВложенияИзПочты", Ложь);
	Результат.Вставить("ЧастотаОтправкиВложенийИзПочтыНаРаспознавание", 30);
	Результат.Вставить("ЭлектроннаяПочтаДляОбработкиВложений", Неопределено);
	Результат.Вставить("ДатаПоследнейОбработкиВложений", '00010101');
	
	Результат.Вставить("РаспознаватьФайлыИзКаталога", Ложь);
	Результат.Вставить("ЧастотаОтправкиФайловИзКаталогаНаРаспознавание", 30);
	Результат.Вставить("КаталогДляОбработкиФайлов", 0);
	Результат.Вставить("ВключаяВложенныеКаталоги", 0);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
